{
  "topics": [
    {
      "id": 1,
      "name": "কম্পোজিট প্রাইমারি কী",
      "definition": "যখন কোনো একক অ্যাট্রিবিউট দিয়ে টেবিলের প্রতিটি রেকর্ডকে শনাক্ত করা সম্ভব হয় না, তখন দুই বা ততোধিক অ্যাট্রিবিউট একত্রে ব্যবহার করে যে প্রাইমারি কী তৈরি করা হয় তাকে কম্পোজিট প্রাইমারি কী বলে।"
    },
    {
      "id": 2,
      "name": "RDBMS",
      "definition": "টেবিল আকারে সংগঠিত ডেটার মধ্যে প্রাইমারি কী ও ফরেন কী-এর মাধ্যমে সম্পর্ক স্থাপন করা যায়। এভাবে সম্পর্কিত টেবিলগুলির সমন্বয়ে যে ডেটাবেজ গঠিত হয় তাকে Relational Database বলা হয়। আর এ ধরনের ডেটাবেজ পরিচালনা করার সফটওয়্যারকে RDBMS বলা হয়।"
    },
    {
      "id": 3,
      "name": "DBMS",
      "definition": "ডেটাবেজ ম্যানেজমেন্ট সিস্টেম (DBMS) হলো এমন একটি সফটওয়্যার সিস্টেম, যা ডেটাকে এক্সেস, সংরক্ষণ, হালনাগাদ, নিয়ন্ত্রণ এবং নিরাপত্তা প্রদানের কাজ করে।"
    },
    {
      "id": 4,
      "name": "ডেটা টাইপ",
      "definition": "ডেটাবেজে টেবিল তৈরির সময় প্রতিটি কলামে কোন ধরনের ডেটা (যেমন—সংখ্যা, টেক্সট, তারিখ ইত্যাদি) রাখা হবে তা নির্ধারণ করা হয়। ডেটার এই ধরণকেই ডেটা টাইপ বলে।"
    },
    {
      "id": 5,
      "name": "সাইফার টেক্সট",
      "definition": "এনক্রিপশনের মাধ্যমে মূল বার্তাকে রূপান্তরিত করার পর যে বার্তা তৈরি হয় এবং যা মানুষের পাঠযোগ্য থাকে না, তাকে সাইফার টেক্সট বলে।"
    },
    {
      "id": 6,
      "name": "কর্পোরেট ডেটাবেজ",
      "definition": "কোনো বৃহৎ কর্পোরেট প্রতিষ্ঠান বা এন্টারপ্রাইজের বিভিন্ন বিভাগ ও শাখার যাবতীয় তথ্য সংরক্ষণ করে যে ডেটাবেজ তৈরি হয়, তাকে কর্পোরেট ডেটাবেজ বলে।"
    },
    {
      "id": 7,
      "name": "জাংশন টেবিল",
      "definition": "অনেক-থেকে-অনেক (Many-to-Many) সম্পর্ক তৈরি করতে যে টেবিল ব্যবহৃত হয় এবং যার প্রাইমারি কী সাধারণত দুটি বা ততোধিক ফরেন কী-এর সমন্বয়ে গঠিত থাকে তাকে জাংশন টেবিল বলা হয়।"
    },
    {
      "id": 8,
      "name": "ডেটাবেজ",
      "definition": "পরস্পর সম্পর্কযুক্ত এক বা একাধিক ডেটা টেবিল বা ফাইলের সমষ্টিকে ডেটাবেজ বলে।"
    },
    {
      "id": 9,
      "name": "ডেটার নিরাপত্তায় এনক্রিপশন",
      "definition": "এনক্রিপশন হলো এমন একটি প্রক্রিয়া যেখানে মূল বার্তাকে বিশেষ অ্যালগরিদম/কোড ব্যবহার করে একটি অপাঠ্য রূপে রূপান্তর করা হয়। এর ফলে অনুমোদনহীন কেউ বার্তাটি পড়তে বা বুঝতে পারে না। প্রেরক ডেটাকে এনক্রিপ্ট করে পাঠায় এবং প্রাপক নির্দিষ্ট কী ব্যবহার করে সেটিকে ডিক্রিপ্ট করে মূল বার্তা বের করে। এভাবে এনক্রিপশন ডেটার গোপনীয়তা, অখণ্ডতা ও নিরাপত্তা নিশ্চিত করে।"
    }
  ]
}