{
  "topics": [
    {
      "id": 1,
      "name": "ওয়েবপেজ (Webpage)",
      "definition": "এটি হলো ওয়ার্ল্ড ওয়াইড ওয়েবে প্রদর্শনের জন্য তৈরি একটি একক ডিজিটাল নথি। একটি ওয়েবপেজ মূলত HTML কোডের মাধ্যমে কাঠামোবদ্ধ হয় এবং এতে টেক্সট, ছবি, ভিডিও, ও ইন্টারেক্টিভ ফর্মের মতো মাল্টিমিডিয়া উপাদান থাকতে পারে। এটি হলো একটি ওয়েবসাইটের মৌলিক বিল্ডিং ব্লক এবং প্রতিটি পেজ তার নিজস্ব URL দ্বারা চিহ্নিত হয়। যখন তুমি একটি ওয়েবসাইটে হোমপেজ, 'আমাদের সম্পর্কে' (About Us) পেজ, বা 'যোগাযোগ' (Contact) পেজ দেখো, তখন এদের প্রতিটিই একেকটি স্বতন্ত্র ওয়েবপেজ।"
    },
    {
      "id": 2,
      "name": "ওয়েবসাইট (Website)",
      "definition": "এটি হলো একটি সুসংগঠিত এবং কাঠামোগত সংগ্রহ, যা একই ডোমেইন নামের অধীনে রাখা একাধিক ওয়েবপেজ, মাল্টিমিডিয়া ফাইল এবং অন্যান্য ডিজিটাল রিসোর্স নিয়ে গঠিত। এই সমগ্র সংগ্রহটি একটি সার্ভারে সংরক্ষিত থাকে এবং একটি একক পরিচয়ের (যেমন: google.com) মাধ্যমে বিশ্বব্যাপী অ্যাক্সেস করা যায়। গুগল, উইকিপিডিয়া বা তোমার প্রিয় অনলাইন সংবাদপত্র— এদের সম্পূর্ণ প্ল্যাটফর্মটিই একটি ওয়েবসাইট, যার মধ্যে হাজার হাজার ওয়েবপেজ থাকতে পারে।"
    },
    {
      "id": 3,
      "name": "ওয়েব ব্রাউজার (Web Browser)",
      "definition": "এটি একটি ক্লায়েন্ট অ্যাপ্লিকেশন সফটওয়্যার। এর প্রধান কাজ হলো ব্যবহারকারীর পক্ষ থেকে সার্ভার-এ HTTP অনুরোধ পাঠানো, প্রাপ্ত ডেটা পুনরুদ্ধার করা এবং HTML সহ অন্যান্য কোডগুলো বিশ্লেষণ (Parse) করে সেগুলোকে একটি দৃশ্যমান ও ইন্টারেক্টিভ ফরম্যাটে ব্যবহারকারীর ডিভাইসে প্রদর্শন করা। এটি ব্যবহারকারীকে ইন্টারনেটে নেভিগেট করতে সাহায্য করে। Google Chrome, Mozilla Firefox, Microsoft Edge, এবং Safari হলো বহুল ব্যবহৃত কিছু ওয়েব ব্রাউজার।"
    },
    {
      "id": 4,
      "name": "সার্ভার (Server)",
      "definition": "এটি একটি শক্তিশালী কম্পিউটার সিস্টেম, যা একটি নেটওয়ার্কের মধ্যে অন্যান্য কম্পিউটার বা প্রোগ্রাম (ক্লায়েন্ট) থেকে অনুরোধ গ্রহণ করে এবং তাদের প্রয়োজনীয় পরিষেবা বা ডেটা সরবরাহ করে। একটি ওয়েবসাইটের ক্ষেত্রে, সার্ভার হলো সেই স্থান যেখানে ওয়েবসাইটের সমস্ত ফাইল ও ডেটা সংরক্ষিত থাকে এবং ক্লায়েন্টের (ওয়েব ব্রাউজার) অনুরোধে তা সরবরাহ করা হয়। যখন তুমি কোনো ওয়েবসাইট লোড করতে চাও, তখন তোমার ওয়েব ব্রাউজার-টি সেই ওয়েবসাইটের সার্ভার-এ একটি অনুরোধ পাঠায়।"
    },
    {
      "id": 5,
      "name": "আইপি (IP) - ইন্টারনেট প্রোটোকল",
      "definition": "ইন্টারনেট প্রোটোকল (Internet Protocol) হলো একটি সাংখ্যিক লেবেল বা ঠিকানা, যা ইন্টারনেটে সংযুক্ত প্রতিটি ডিভাইসকে (যেমন— কম্পিউটার, ফোন, সার্ভার) এককভাবে শনাক্ত করে। এর প্রধান কাজ হলো নেটওয়ার্কের মধ্যে ডেটা প্যাকেটগুলোকে সোর্স থেকে ডেস্টিনেশনে প্রেরণের সঠিক পথ নির্ধারণ করা। তোমার বাড়ির ঠিকানার মতো, প্রতিটি ডিভাইসের একটি আইপি ঠিকানা থাকে (যেমন: *192.168.1.1*)। এই ঠিকানা ব্যবহার করেই সার্ভার তোমার ব্রাউজারে সঠিক ডেটা পাঠাতে পারে।"
    },
    {
      "id": 6,
      "name": "URL - ইউনিফর্ম রিসোর্স লোকেটর",
      "definition": "ইউনিফর্ম রিসোর্স লোকেটর (Uniform Resource Locator) হলো ইন্টারনেটে বা লোকাল নেটওয়ার্কে অবস্থিত একটি ওয়েবপেজ, ছবি, বা অন্য যেকোনো রিসোর্সের সম্পূর্ণ এবং নির্দিষ্ট ঠিকানা। এটি সাধারণত প্রোটোকল (`https`), ডোমেইন নাম (`example.com`), এবং পাথ (`/blog/article.html`) নিয়ে গঠিত, যা রিসোর্সটির অবস্থান নির্দেশ করে। সম্পূর্ণ ঠিকানাটি: `https://www.google.com/search?q=hello` হলো একটি URL।"
    },
    {
      "id": 7,
      "name": "DNS - ডোমেইন নেম সিস্টেম",
      "definition": "ডোমেইন নেম সিস্টেম (Domain Name System) হলো ইন্টারনেটের একটি ফোনবুক বা অনুবাদক পরিষেবা। এটি মানুষের পক্ষে মনে রাখার উপযোগী ডোমেইন নামকে (যেমন: `facebook.com`) কম্পিউটার দ্বারা ব্যবহৃত সাংখ্যিক আইপি ঠিকানায় (যেমন: `157.240.23.35`) অনুবাদ করে। ব্যবহারকারী যখন ব্রাউজারে ডোমেইন নাম টাইপ করে, তখন DNS সিস্টেম এই নামটিকে সঠিক আইপি ঠিকানায় রূপান্তর করে সার্ভারকে খুঁজে নিতে সাহায্য করে।"
    },
    {
      "id": 8,
      "name": "স্ট্যাটিক ওয়েবসাইট (Static Website)",
      "definition": "যেসব ওয়েবসাইটের ডেটা ফিক্সড এবং পূর্ব-নির্ধারিত থাকে, যা ব্যবহারকারীর ভিন্নতা, ইনপুট, বা সময় অনুসারে স্বয়ংক্রিয়ভাবে পরিবর্তিত হয় না। এই পেজগুলো প্রতিবার একই HTML ও CSS কোড থেকে সরাসরি লোড হয়। একটি ছোট ব্যবসার প্রচারমূলক সাইট, যার একটি নির্দিষ্ট হোমপেজ, 'পরিষেবা' পেজ এবং 'যোগাযোগ' পেজ আছে এবং কন্টেন্ট খুব কমই আপডেট করার প্রয়োজন হয়— সেটি হলো একটি স্ট্যাটিক ওয়েবসাইট।"
    },
    {
      "id": 9,
      "name": "ডাইনামিক ওয়েবসাইট (Dynamic Website)",
      "definition": "যেসব ওয়েবসাইটের কন্টেন্ট ব্যবহারকারীর ইনপুট, সার্ভার-সাইড প্রসেসিং, সময়, বা ডেটাবেজের ডেটার ওপর ভিত্তি করে তাৎক্ষণিকভাবে পরিবর্তিত ও তৈরি হয়। এই ওয়েবসাইটগুলো ব্যবহারকারীকে লগইন, ডেটা সার্চ, কাস্টমাইজড ফিড বা কেনাকাটার মতো ইন্টারেকশনের সুযোগ দেয়। ফেসবুক, ইউটিউব বা একটি অনলাইন শপিং সাইট (যেমন: Amazon) হলো ডাইনামিক ওয়েবসাইট, যেখানে কন্টেন্ট প্রতি মুহূর্তে পরিবর্তিত হচ্ছে।"
    },
    {
      "id": 10,
      "name": "ওয়েবসাইট কাঠামো (Website Structure / Site Map)",
      "definition": "একটি ওয়েবসাইটের সমস্ত ওয়েবপেজ কীভাবে একে অপরের সাথে যুক্ত এবং সংগঠিত, সেই সামগ্রিক নকশাকেই ওয়েবসাইট কাঠামো বা সাইট ম্যাপ বলে। এটি মূলত একটি শ্রেণীবদ্ধ বা অনুক্রমিক বিন্যাসে পেজগুলির অভ্যন্তরীণ লিঙ্কিং নির্দেশ করে। একটি আদর্শ কাঠামো হতে পারে: হোমপেজ ➡️ পরিষেবা পেজ ➡️ প্রতিটি পরিষেবার জন্য আলাদা উপ-পেজ, যা নেভিগেশন উন্নত করে এবং SEO-এর জন্য গুরুত্বপূর্ণ।"
    },
    {
      "id": 11,
      "name": "HTML - হাইপারটেক্সট মার্কআপ ল্যাঙ্গুয়েজ",
      "definition": "হাইপারটেক্সট মার্কআপ ল্যাঙ্গুয়েজ (HyperText Markup Language) হলো একটি স্ট্যান্ডার্ড মার্কআপ ল্যাঙ্গুয়েজ, যা ওয়েবপেজের মৌলিক কাঠামো তৈরি করতে ব্যবহৃত হয়। এটি বিভিন্ন ট্যাগ ব্যবহার করে ওয়েব ব্রাউজারকে নির্দেশ দেয় যে কন্টেন্টটি কীভাবে গঠিত। উদাহরণস্বরূপ, একটি শিরোনাম তৈরি করতে: `<h1>এটি প্রধান শিরোনাম</h1>` এবং একটি প্যারাগ্রাফ তৈরি করতে: `<p>এটি একটি অনুচ্ছেদ</p>` ব্যবহার করা হয়।"
    },
    {
      "id": 12,
      "name": "HTTP - হাইপারটেক্সট ট্রান্সফার প্রোটোকল",
      "definition": "হাইপারটেক্সট ট্রান্সফার প্রোটোকল (HyperText Transfer Protocol) হলো একটি অ্যাপ্লিকেশন-লেয়ার প্রোটোকল, যা ওয়ার্ল্ড ওয়াইড ওয়েবে ওয়েব সার্ভার এবং ব্রাউজারের মধ্যে ডেটা আদান-প্রদানে ব্যবহৃত হয়। একটি ওয়েবপেজ অ্যাক্সেস করার সময় এই প্রোটোকলটিই ক্লায়েন্ট এবং সার্ভারের মধ্যে যোগাযোগের নিয়মাবলী স্থাপন করে। যখন তুমি কোনো URL-এ ক্লিক করো, তখন তোমার ব্রাউজার HTTP বা HTTPS ব্যবহার করে সার্ভার-এ 'GET' নামক একটি অনুরোধ পাঠায়।"
    },
    {
      "id": 13,
      "name": "HTML ট্যাগ (HTML Tag)",
      "definition": "HTML ডকুমেন্টে কন্টেন্টকে চিহ্নিত, সংজ্ঞায়িত ও বিন্যস্ত করার জন্য ব্যবহৃত বিশেষ নির্দেশিকা বা কোড, যা সাধারণত অ্যাঙ্গেল ব্র্যাকেটের (`< >`) মধ্যে লেখা হয়। বেশিরভাগ ট্যাগ একটি স্টার্টিং ট্যাগ (যেমন: `<div>`) এবং একটি এন্ডিং ট্যাগ (যেমন: `</div>`) নিয়ে গঠিত হয়। যেমন— `<body>` ট্যাগটি সম্পূর্ণ পেজের ভিজ্যুয়াল কন্টেন্টকে ধারণ করে এবং `<a>` ট্যাগটি একটি হাইপারলিঙ্ক তৈরি করতে ব্যবহৃত হয়।"
    },
    {
      "id": 14,
      "name": "HTML অ্যাট্রিবিউট (HTML Attribute)",
      "definition": "একটি HTML ট্যাগকে অতিরিক্ত তথ্য বা বৈশিষ্ট্য প্রদান করার জন্য ব্যবহৃত বিশেষ উপাদান। এটি সর্বদা স্টার্টিং ট্যাগের মধ্যে নাম-মান জোড়া (`name='value'`) আকারে লেখা হয় এবং ট্যাগটির আচরণ, স্টাইল বা অ্যাক্সেসযোগ্যতা পরিবর্তন করে। উদাহরণস্বরূপ, একটি ছবিতে অ্যাট্রিবিউট-এর ব্যবহার: `<img src='pic.jpg' alt='ছবিটির বর্ণনা'>`। এখানে `src` এবং `alt` হলো অ্যাট্রিবিউট।"
    },
    {
      "id": 15,
      "name": "HTML উপাদান (HTML Element)",
      "definition": "একটি স্টার্টিং ট্যাগ (যেমন: `<h1>`), তার ভেতরের কন্টেন্ট (যেমন: 'স্বাগতম'), এবং একটি এন্ডিং ট্যাগ (যেমন: `</h1>`)— এই তিনটির সমন্বয়ে গঠিত সম্পূর্ণ একক অংশকে HTML উপাদান (Element) বলা হয়। এটি HTML ডকুমেন্টের সবচেয়ে মৌলিক অংশ এবং এটিই কন্টেন্টকে একটি নির্দিষ্ট কাঠামো প্রদান করে। সম্পূর্ণ অংশটি: `<p>এটি একটি সম্পূর্ণ HTML উপাদান।</p>` যেখানে `<p>` হলো স্টার্টিং ট্যাগ, এবং `</p>` হলো এন্ডিং ট্যাগ।"
    },
    {
      "id": 16,
      "name": "এম্পটি ট্যাগ (Empty Tag / Void Tag)",
      "definition": "যেসব HTML ট্যাগের কোনো সমাপ্তি ট্যাগ (`</tag>`) বা মাঝখানে কোনো কন্টেন্ট থাকে না, এবং যা শুধু একটি স্টার্টিং ট্যাগ দিয়েই গঠিত হয়, তাকে এম্পটি ট্যাগ বা একক ট্যাগ বলা হয়। এই ট্যাগগুলো সাধারণত একটি বিশেষ অ্যাকশন সম্পাদন করে বা ডকুমেন্ট-এ কিছু সন্নিবেশ করে, তবে কোনো টেক্সট বা অন্যান্য উপাদানকে আবদ্ধ করে না। উদাহরণ: একটি লাইন ব্রেক তৈরি করতে ব্যবহৃত ট্যাগ: `<br>` এবং ছবিতে সংযোগ করার জন্য ব্যবহৃত ট্যাগ: `<img src='image.jpg'>`— এইগুলি হলো এম্পটি ট্যাগ।"
    },
    {
      "id": 17,
      "name": "ওয়েবসাইট পাবলিশিং (Website Publishing)",
      "definition": "তৈরি করা ওয়েবসাইটটিকে সকলের জন্য ইন্টারনেটে স্থায়ীভাবে উন্মুক্ত ও অ্যাক্সেসযোগ্য করার সামগ্রিক প্রক্রিয়া। এই প্রক্রিয়ায় প্রধানত দুটি ধাপ থাকে: প্রথমে একটি অনন্য ডোমেইন নাম রেজিস্ট্রেশন করা এবং দ্বিতীয়ত, ওয়েবসাইটের সমস্ত ফাইল ও ডেটা একটি হোস্টিং সার্ভারে আপলোড করা। একটি ওয়েবসাইটের সমস্ত HTML, CSS ও ছবিগুলো কিনে রাখা হোস্টিং স্পেসে FTP ব্যবহার করে আপলোড করার প্রক্রিয়াটি হলো ওয়েবসাইট পাবলিশিং।"
    },
    {
      "id": 18,
      "name": "SEO - সার্চ ইঞ্জিন অপটিমাইজেশন",
      "definition": "সার্চ ইঞ্জিন অপটিমাইজেশন (Search Engine Optimization) হলো একটি পদ্ধতিগত প্রক্রিয়া, যার মাধ্যমে একটি ওয়েবসাইটকে গুগল বা বিং-এর মতো সার্চ ইঞ্জিনের ফলাফলের তালিকায় (SERP) উচ্চতর র্যাঙ্কিং-এ দেখানোর জন্য টেকনিক্যাল এবং কন্টেন্টের দিক থেকে উন্নত ও উপযোগী করা হয়। এর ফলে সাইটে অর্গানিক (বিনামূল্যে) ট্র্যাফিক বাড়ে। উদাহরণস্বরূপ, ওয়েবপেজের শিরোনামে (`<title>`) প্রাসঙ্গিক কীওয়ার্ড ব্যবহার করা এবং ভালো মানের কন্টেন্ট তৈরি করা হলো SEO-এর অংশ।"
    },
    {
      "id": 19,
      "name": "এইচটিএমএল লিস্ট (HTML List)",
      "definition": "HTML ডকুমেন্টে তথ্যগুলোকে সুশৃঙ্খল এবং গঠনগতভাবে সাজিয়ে দেখানোর জন্য ব্যবহৃত একটি কাঠামোগত পদ্ধতি। এটি প্রধানত তিন প্রকার: অর্ডার্ড লিস্ট (`<ol>`, যা সংখ্যা দ্বারা চিহ্নিত), আনঅর্ডার্ড লিস্ট (`<ul>`, যা বুলেট পয়েন্ট দ্বারা চিহ্নিত), এবং ডেফিনিশন লিস্ট (`<dl>`)। একটি আনঅর্ডার্ড লিস্টের জন্য কোডটি এমন হবে: `<ul><li>আপেল</li><li>কলা</li></ul>`। এটি ওয়েবপেজে বুলেট পয়েন্ট আকারে ফলগুলোর নাম দেখাবে।"
    }
  ]
}
