{
  "topics": [
    {
      "id": 1,
      "name": "ব্যান্ডউইথ",
      "definition": "প্রতি সেকেন্ডে যে পরিমাণ ডেটা বা বিট এক স্থান হতে অন্য স্থানে স্থানান্তরিত হয় তাকে ব্যান্ডউইথ বলে। ব্যান্ডউইথ (bps) bit per second দ্বারা হিসাব করা হয়। উদাহরণ: 5 bps বলতে এক সেকেন্ডে 5 বিট স্থানান্তর হওয়া বোঝায়।"
    },
    {
      "id": 2,
      "name": "ন্যারো ব্যান্ড",
      "definition": "যে ব্যান্ডে ডেটা স্থানান্তর গতি সাধারণত সর্বনিম্ন 45bps থেকে সর্বোচ্চ 300bps পর্যন্ত হয়ে থাকে তাকে ন্যারো ব্যান্ড বলে। টেলিগ্রাফিতে এটি ব্যবহার হয়।"
    },
    {
      "id": 3,
      "name": "ভয়েস ব্যান্ড",
      "definition": "যে ব্যান্ডে ডেটা স্থানান্তর গতি সাধারণত 1200bps থেকে 9600bps পর্যন্ত হয়ে থাকে তাকে ভয়েস ব্যান্ড বলে। টেলিফোন লাইন, কিবোর্ড-কম্পিউটার ও প্রিন্টারে এই ব্যান্ড ব্যবহৃত হয়।"
    },
    {
      "id": 4,
      "name": "ব্রড ব্যান্ড",
      "definition": "যে ব্যান্ডে ডেটা স্থানান্তর গতি সাধারণত সর্বনিম্ন 1Mbps থেকে কয়েক Gbps পর্যন্ত হয় তাকে ব্রড ব্যান্ড বলে। সাধারণত অপটিক্যাল ফাইবার, ওয়াইফাই, ওয়াইম্যাক্সে ব্যবহার হয়।",
      "imageUrl": "https://raw.githubusercontent.com/promahadihasan/aiIctTutor/refs/heads/main/students/assets/images/sunny.png"
    },
    {
      "id": 5,
      "name": "অ্যাসিনক্রোনাস ট্রান্সমিশন",
      "definition": "যে ট্রান্সমিশন সিস্টেমে প্রেরক থেকে ডেটা গ্রাহকে ক্যারেক্টার বাই ক্যারেক্টার ট্রান্সমিট হয় তাকে অ্যাসিনক্রোনাস বলে। সুবিধা: সহজ বাস্তবায়ন, কম ব্যয়। অসুবিধা: গতি কম, স্টার্ট/স্টপ বিট প্রয়োজন। দক্ষতা ~72%-73%।"
    },
    {
      "id": 6,
      "name": "সিনক্রোনাস ট্রান্সমিশন",
      "definition": "প্রেরক থেকে প্রতিবারে 80-132 ক্যারেক্টারের ব্লক ট্রান্সমিট হলে সেটিকে সিনক্রোনাস ট্রান্সমিশন বলে। সুবিধা: উচ্চ দক্ষতা (94%-95%)। অসুবিধা: হেডার, ট্রেলার ও স্টোরেজ প্রয়োজন, ব্যয়বহুল।"
    },
    {
      "id": 7,
      "name": "সিমপ্লেক্স মোড",
      "definition": "ডেটা শুধু একদিকে প্রেরণ হয়। উদাহরণ: কিবোর্ড-কম্পিউটার, রেডিও, টেলিভিশন।"
    },
    {
      "id": 8,
      "name": "হাফ ডুপ্লেক্স মোড",
      "definition": "ডেটা উভয় দিকে আদান-প্রদান হয় কিন্তু একসাথে নয়। উদাহরণ: ওয়াকি-টকি, ফ্যাক্স, এসএমএস।"
    },
    {
      "id": 9,
      "name": "ফুল ডুপ্লেক্স মোড",
      "definition": "ডেটা একই সাথে উভয়দিকে আদান প্রদান করা যায়। উদাহরণ: মোবাইল ফোন।"
    },
    {
      "id": 10,
      "name": "ইউনিকাস্ট মোড",
      "definition": "একটি প্রেরক থেকে শুধুমাত্র একটি প্রাপক ডেটা গ্রহণ করতে পারে। উদাহরণ: এসএমএস, ফ্যাক্স।"
    },
    {
      "id": 11,
      "name": "ব্রডকাস্ট মোড",
      "definition": "নেটওয়ার্কে একটি নোড ডেটা পাঠালে সকল নোড গ্রহণ করে। উদাহরণ: টিভি, রেডিও সম্প্রচার।"
    },
    {
      "id": 12,
      "name": "মাল্টিকাস্ট মোড",
      "definition": "একটি নোড থেকে ডেটা শুধুমাত্র নির্দিষ্ট গ্রুপের সদস্যরা গ্রহণ করতে পারে। উদাহরণ: ভিডিও গ্রুপিং, চ্যাটিং।"
    },
    {
      "id": 13,
      "name": "অপটিক্যাল ফাইবার ক্যাবল",
      "definition": "কাঁচ, তন্তু ও আলোর পূর্ণ অভ্যন্তরীণ প্রতিফলন ব্যবহার করে তৈরি। প্রকার: সিঙ্গেল মোড, মাল্টি মোড। দুরপাল্লায় সিঙ্গেল মোড ব্যবহৃত হয়।",
      "imageUrl": "https://raw.githubusercontent.com/promahadihasan/aiIctTutor/refs/heads/main/students/assets/images/sunny.png"
    },
    {
      "id": 14,
      "name": "রেডিও ওয়েভ",
      "definition": "ফ্রিকোয়েন্সি 3KHz-300GHz। পাহাড় ও বিল্ডিং ভেদ করতে পারে। রেডিও ও টিভি সম্প্রচারে ব্যবহৃত হয়।"
    },
    {
      "id": 15,
      "name": "মাইক্রো ওয়েভ",
      "definition": "ফ্রিকোয়েন্সি 300MHz-300GHz। বাঁকা পথে চলতে পারে না। টেলিযোগাযোগ ও মোবাইল নেটওয়ার্কে ব্যবহৃত হয়।"
    },
    {
      "id": 16,
      "name": "মডেম",
      "definition": "মডুলেটর ও ডিমডুলেটর এর সমন্বয়। বর্তমানে ফাইবার ও ওয়াইফাই ব্যবহারে এর ব্যবহার কমে যাচ্ছে।"
    },
    {
      "id": 17,
      "name": "হাব",
      "definition": "একটি কম্পিউটারের সাথে অন্য ডিভাইস নেটওয়ার্কে সংযুক্ত করতে ব্যবহৃত হয়।"
    },
    {
      "id": 18,
      "name": "সুইচ",
      "definition": "হাবের উন্নত সংস্করণ, বুদ্ধিমত্তা সম্পন্ন। ৮, ১৬, ৩২ পোর্ট থাকে। স্টার টপোলজিতে ব্যবহৃত হয়।"
    },
    {
      "id": 19,
      "name": "রাউটার",
      "definition": "একই প্রটোকলভুক্ত দুই বা ততোধিক স্বতন্ত্র নেটওয়ার্ক সংযোগ করে নেটওয়ার্ক সম্প্রসারণ করে।"
    },
    {
      "id": 20,
      "name": "গেটওয়ে",
      "definition": "ভিন্ন প্রটোকল বিশিষ্ট নেটওয়ার্কগুলোর মধ্যে সংযোগ স্থাপন করে।"
    },
    {
      "id": 21,
      "name": "নেটওয়ার্ক টপোলজি",
      "definition": "কম্পিউটার ও অন্যান্য ডিভাইস কিভাবে সংযুক্ত হয়ে ডেটা আদান প্রদান করে তার পরিকল্পনা।"
    },
    {
      "id": 22,
      "name": "ক্লাউড কম্পিউটিং",
      "definition": "প্রয়োজন অনুযায়ী নির্দিষ্ট ফি এর বিনিময়ে ইন্টারনেটের মাধ্যমে হার্ডওয়ার ও সফটওয়ার ব্যবহার করার পদ্ধতি।"
    }
  ]
}
