{
  "topics": [
  {
    "id": 1,
    "name": "ওয়েবপেজ",
    "definition": "ইন্টারনেটে প্রদর্শনের জন্য তৈরি, HTML কোডের মাধ্যমে সুসজ্জিত একটি একক ডকুমেন্টকে ওয়েবপেজ বলে। এতে টেক্সট, ছবি, ভিডিও ইত্যাদি থাকতে পারে এবং এটি সাধারণত একটি নির্দিষ্ট URL দ্বারা অ্যাক্সেস করা হয়।"
  },
  {
    "id": 2,
    "name": "ওয়েবসাইট",
    "definition": "একই ডোমেইন নামের অধীনে রাখা একাধিক ওয়েবপেজ, মাল্টিমিডিয়া ও অন্যান্য রিসোর্সের একটি সমষ্টি, যা কোনো সার্ভারে সংরক্ষণ করা থাকে।"
  },
  {
    "id": 3,
    "name": "ওয়েব ব্রাউজার",
    "definition": "এটি এমন একটি অ্যাপ্লিকেশন সফটওয়্যার, যা ব্যবহারকারীকে ওয়েবপেজ দেখতে, নেভিগেট করতে এবং ইন্টারনেটে তথ্য অ্যাক্সেস করতে সাহায্য করে। যেমন— Google Chrome, Firefox, Safari ইত্যাদি।"
  },
  {
    "id": 4,
    "name": "সার্ভার",
    "definition": "একটি শক্তিশালী কম্পিউটার সিস্টেম, যা ক্লায়েন্ট (যেমন— ওয়েব ব্রাউজার) থেকে অনুরোধ গ্রহণ করে এবং ওয়েবপেজ বা ডেটার মতো প্রয়োজনীয় রিসোর্স সরবরাহ করে।"
  },
  {
    "id": 5,
    "name": "আইপি",
    "definition": "ইন্টারনেট প্রোটোকল (Internet Protocol) হলো এমন একটি নিউমেরিক লেবেল, যা ইন্টারনেটে যুক্ত প্রতিটি ডিভাইসকে এককভাবে শনাক্ত করে এবং তাদের মধ্যে ডেটা প্রেরণের পথ নির্ধারণ করে।"
  },
  {
    "id": 6,
    "name": "URL",
    "definition": "ইউনিফর্ম রিসোর্স লোকেটর (Uniform Resource Locator) হলো একটি ওয়েবপেজ বা অন্য কোনো রিসোর্সের সম্পূর্ণ ঠিকানা, যা ইন্টারনেট বা লোকাল নেটওয়ার্কে সেই রিসোর্সের অবস্থান নির্দেশ করে।"
  },
  {
    "id": 7,
    "name": "DNS",
    "definition": "ডোমেইন নেম সিস্টেম (Domain Name System) হলো এমন একটি পরিষেবা, যা মানুষের বোঝার উপযোগী ডোমেইন নামকে (যেমন: google.com) মেশিনের বোঝার উপযোগী আইপি ঠিকানায় অনুবাদ করে।"
  },
  {
    "id": 8,
    "name": "স্ট্যাটিক ওয়েবসাইট",
    "definition": "যেসব ওয়েবসাইটের ডেটা ফিক্সড থাকে এবং ব্যবহারকারীর ভিন্নতা বা সময় অনুসারে পরিবর্তন হয় না, সেগুলোকে স্ট্যাটিক ওয়েবসাইট বলে। এগুলো HTML, CSS ব্যবহার করে তৈরি করা হয়।"
  },
  {
    "id": 9,
    "name": "ডাইনামিক ওয়েবসাইট",
    "definition": "যেসব ওয়েবসাইটের কন্টেন্ট ব্যবহারকারীর ইনপুট, সময়, বা ডেটাবেজের ডেটার ওপর ভিত্তি করে স্বয়ংক্রিয়ভাবে পরিবর্তিত হয়, সেগুলোকে ডাইনামিক ওয়েবসাইট বলে। যেমন— ফেসবুক বা ইউটিউব।"
  },
  {
    "id": 10,
    "name": "ওয়েবসাইট কাঠামো",
    "definition": "একটি ওয়েবসাইটের বিভিন্ন পেজ কীভাবে একে অপরের সাথে যুক্ত এবং সংগঠিত, সেই নকশাকেই ওয়েবসাইট কাঠামো বা সাইট ম্যাপ বলে। এটি নেভিগেশন এবং SEO-এর জন্য গুরুত্বপূর্ণ।"
  },
  {
    "id": 11,
    "name": "HTML",
    "definition": "হাইপারটেক্সট মার্কআপ ল্যাঙ্গুয়েজ (HyperText Markup Language) হলো একটি স্ট্যান্ডার্ড মার্কআপ ল্যাঙ্গুয়েজ, যা ওয়েবপেজের কাঠামো তৈরি এবং এর উপাদানগুলো (যেমন— টেক্সট, ছবি) বিন্যস্ত করতে ব্যবহৃত হয়।"
  },
  {
    "id": 12,
    "name": "HTTP",
    "definition": "হাইপারটেক্সট ট্রান্সফার প্রোটোকল (HyperText Transfer Protocol) হলো একটি অ্যাপ্লিকেশন প্রোটোকল, যা ওয়েব সার্ভার এবং ব্রাউজারের মধ্যে ওয়েবপেজসহ অন্যান্য ডেটা আদান-প্রদানে ব্যবহৃত হয়।"
  },
  {
    "id": 13,
    "name": "HTML ট্যাগ",
    "definition": "HTML ডকুমেন্টে কন্টেন্টকে চিহ্নিত ও বিন্যস্ত করার জন্য ব্যবহৃত বিশেষ কোড, যা সাধারণত অ্যাঙ্গেল ব্র্যাকেটের (< >) মধ্যে লেখা হয়। যেমন— `<p>`, `<h1>`।"
  },
  {
    "id": 14,
    "name": "HTML অ্যাট্রিবিউট",
    "definition": "একটি HTML ট্যাগকে অতিরিক্ত তথ্য প্রদান করার জন্য ব্যবহৃত বিশেষ উপাদান। এটি সাধারণত স্টার্টিং ট্যাগের মধ্যে নাম-মান জোড়া (Name-Value Pair) আকারে লেখা হয়। যেমন— `<a href='link'>`।"
  },
  {
    "id": 15,
    "name": "HTML উপাদান",
    "definition": "একটি স্টার্টিং ট্যাগ, তার কন্টেন্ট এবং একটি এন্ডিং ট্যাগ— এই তিনটির সমন্বয়ে গঠিত সম্পূর্ণ অংশকে HTML উপাদান (Element) বলা হয়। যেমন— `<p>এটি একটি প্যারাগ্রাফ</p>`।"
  },
  {
    "id": 16,
    "name": "এম্পটি ট্যাগ",
    "definition": "যেসব HTML ট্যাগের কোনো সমাপ্তি ট্যাগ বা কন্টেন্ট থাকে না এবং যা শুধু একটি স্টার্টিং ট্যাগ দিয়েই গঠিত হয়, তাকে এম্পটি ট্যাগ বা একক ট্যাগ বলে। যেমন— `<br>`, `<img>`।"
  },
  {
    "id": 17,
    "name": "ওয়েবসাইট পাবলিশিং",
    "definition": "তৈরি করা ওয়েবসাইটটিকে সকলের জন্য ইন্টারনেটে উন্মুক্ত করার প্রক্রিয়াকে ওয়েবসাইট পাবলিশিং বলে। এই প্রক্রিয়ার মধ্যে সাধারণত ডোমেইন নাম রেজিস্ট্রেশন ও হোস্টিং সার্ভারে ফাইল আপলোড করা অন্তর্ভুক্ত।"
  },
  {
    "id": 18,
    "name": "SEO",
    "definition": "সার্চ ইঞ্জিন অপটিমাইজেশন (Search Engine Optimization) হলো এমন একটি প্রক্রিয়া, যার মাধ্যমে একটি ওয়েবসাইটকে সার্চ ইঞ্জিনের ফলাফলের তালিকায় (যেমন— গুগল) উপরে দেখানোর জন্য উন্নত করা হয়।"
  },
  {
    "id": 19,
    "name": "এইচটিএমএল লিস্ট",
    "definition": "HTML ডকুমেন্টে তথ্যগুলোকে সুশৃঙ্খলভাবে সাজিয়ে দেখানোর জন্য ব্যবহৃত একটি কাঠামো। এটি প্রধানত তিন প্রকার— অর্ডার্ড লিস্ট (`<ol>`), আনঅর্ডার্ড লিস্ট (`<ul>`), এবং ডেফিনিশন লিস্ট (`<dl>`)।"
  }

  ]
}
